Repository: jvlianodorneles/telestream-tui
Catalog: locale/*/LC_MESSAGES/messages.po
Languages: it

source: Are you sure you want to quit?
it: Sei sicuro di voler uscire?

source: ✅ Yes
it: ✅ Sì

source: File Browser
it: Browser File

source: ⬅️ Back
it: ⬅️ Indietro

source: Back
it: Indietro

source: About/Donate
it: Informazioni/Donazioni

source: Enjoying the app? Consider sending a collectible gift on Telegram: https://t.me/jvlianodorneles
it: Ti piace l'app? Considera di inviare un regalo da collezione su Telegram: https://t.me/jvlianodorneles

source: Manage Favorites
it: Gestisci Preferiti

source: Favorite Servers
it: Server Preferiti

source: Name:
it: Nome:

source: Server Name
it: Nome Server

source: Server URL:
it: URL Server:

source: Stream Key:
it: Chiave Stream:

source: secret_key
it: chiave_segreta

source: 👁️ Show
it: 👁️ Mostra

source: ➕ Add
it: ➕ Aggiungi

source: 💾 Save Edit
it: 💾 Salva Modifica

source: 🗑️ Remove
it: 🗑️ Rimuovi

source: 🧹 Clear Fields
it: 🧹 Pulisci Campi

source: Name
it: Nome

source: Key
it: Chiave

source: 🙈 Hide
it: 🙈 Nascondi

source: [ERROR] All fields (Name, URL, Key) are required.
it: [ERRORE] Tutti i campi (Nome, URL, Chiave) sono obbligatori.

source: [ERROR] No favorite selected for editing.
it: [ERRORE] Nessun preferito selezionato per la modifica.

source: [ERROR] No favorite selected for removal.
it: [ERRORE] Nessun preferito selezionato per la rimozione.

source: Application Log
it: Log Applicazione

source: Toggle dark mode
it: Attiva/disattiva modalità scura

source: Quit
it: Esci

source: Video Path:
it: Percorso Video:

source: e.g.: /home/user/video.mp4
it: es.: /home/utente/video.mp4

source: 📁 Browse...
it: 📁 Sfoglia...

source: Or YouTube URL:
it: Oppure URL YouTube:

source: e.g.: https://www.youtube.com/watch?v=...
it: es.: https://www.youtube.com/watch?v=...

source: Favorite Server:
it: Server Preferito:

source: Server URL (RTMP/RTMPS):
it: URL Server (RTMP/RTMPS):

source: e.g.: rtmps://dc1-1.rtmp.t.me/s/
it: es.: rtmps://dc1-1.rtmp.t.me/s/

source: Telegram Stream Key:
it: Chiave Stream Telegram:

source: e.g.: 123456:abc-123
it: es.: 123456:abc-123

source: ▶️ Start Stream
it: ▶️ Avvia Stream

source: ⏹️ Stop Stream
it: ⏹️ Ferma Stream

source: 📜 Show Log
it: 📜 Mostra Log

source: ℹ️ About/Donate
it: ℹ️ Informazioni/Donazioni

source: ⭐ Manage Favorites
it: ⭐ Gestisci Preferiti

source: [ERROR] Server URL and stream key are required, plus a video path or YouTube URL.
it: [ERRORE] URL del server e chiave di streaming sono obbligatori, più un percorso video o un URL di YouTube.

source: Starting stream...
it: Avvio dello stream...

source: Fetching YouTube stream URL...
it: Recupero dell'URL dello stream di YouTube...

source: Successfully fetched stream URL.
it: URL dello stream recuperato con successo.

source: [ERROR] ffmpeg not found. Check if it's installed and in PATH.
it: [ERRORE] ffmpeg non trovato. Controlla se è installato e nel PATH.

source: Stopping stream...
it: Arresto dello stream...

source: Stream stopped successfully.
it: Stream interrotto con successo.

source: ffmpeg did not respond, forcing termination.
it: ffmpeg non ha risposto, terminazione forzata.

source: Stream forced to stop.
it: Stream interrotto forzatamente.

source: Stream stopped.
it: Stream interrotto.

source: No active stream to stop.
it: Nessuno stream attivo da interrompere.
